{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\research\cpbans\survival-analysis\survival-analysis.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 May 2021, 17:29:43
{txt}
{com}. //_1
. display c(current_date)
{res}29 May 2021
{txt}
{com}. //_2
. display c(current_time)
{res}17:29:43
{txt}
{com}. //_3
. use "../CPBans_w_AllCountries.dta", clear // data with ALL Countries; not just bans
{txt}
{com}. //_4
. generate current_year = year(today()) // variable with current year
{txt}
{com}. //_5
. replace year_of_prohibition = current_year if year_of_prohibition == . // replace missing w/ current year
{txt}(186 real changes made)

{com}. //_6
. generate f = type == "CP Ban" // "failure" variable
{txt}
{com}. //_7
. stset year_of_prohibition, failure(f = 1) // stset the data with time and failure variables

{txt}Survival-time data settings

{col 10}Failure event: {res}f==1
{col 1}{txt}Observed time interval: {res}(0, year_of_prohibition]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}        248{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}        248{txt}  observations remaining, representing
{res}         62{txt}  failures in single-record/single-failure data
{res}    500,452{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}    2,021
{txt}
{com}. //_8
. sts graph, scheme(michigan) tmin(1970) // Kaplan-Meier Survivor Function

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition
{txt}
{com}. //_9
. graph export mysurvival.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
mysurvival.png{rm}
saved as
PNG
format
{p_end}

{com}. //_10
. sts graph, failure scheme(michigan) tmin(1970) // Kaplan-Meier Failure Function

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition
{txt}
{com}. //_11
. graph export myfailure.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
myfailure.png{rm}
saved as
PNG
format
{p_end}

{com}. //_12
. encode continent, generate(continent_NUMERIC) // numeric version of continent
{txt}
{com}. //_13
. streg ib4.continent_NUMERIC, distribution(weibull) // Weibull distribution

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition

{txt}Fitting constant-only model:
Iteration 0:   log likelihood = {res} -148.2325
{txt}Iteration 1:   log likelihood = {res}-86.999055
{txt}Iteration 2:   log likelihood = {res}-27.073844
{txt}Iteration 3:   log likelihood = {res} 29.365489
{txt}Iteration 4:   log likelihood = {res} 77.015953
{txt}Iteration 5:   log likelihood = {res} 106.62899
{txt}Iteration 6:   log likelihood = {res} 115.32234
{txt}Iteration 7:   log likelihood = {res} 115.88805
{txt}Iteration 8:   log likelihood = {res} 115.89021
{txt}Iteration 9:   log likelihood = {res} 115.89021

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log likelihood = {res: 115.89021}  
Iteration 1:{space 3}log likelihood = {res: 139.32561}  
Iteration 2:{space 3}log likelihood = {res: 142.87372}  
Iteration 3:{space 3}log likelihood = {res: 143.05492}  
Iteration 4:{space 3}log likelihood = {res: 143.05732}  
Iteration 5:{space 3}log likelihood = {res: 143.05732}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:248}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:248}
{txt}No. of failures = {res}{ralign 7:62}
{txt}Time at risk    = {res}{ralign 7:500,452}
{col 57}{txt}{lalign 13:LR chi2({res:5})} = {res}{ralign 6:54.33}
{txt}Log likelihood = {res}143.05732{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               _t{col 19}{c |} Haz. ratio{col 31}   Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
continent_NUMERIC {c |}
{space 10}Africa  {c |}{col 19}{res}{space 2} .1684617{col 31}{space 2} .0612563{col 42}{space 1}   -4.90{col 51}{space 3}0.000{col 59}{space 4} .0826011{col 72}{space 3} .3435709
{txt}{space 8}Americas  {c |}{col 19}{res}{space 2} .1938708{col 31}{space 2} .0704541{col 42}{space 1}   -4.51{col 51}{space 3}0.000{col 59}{space 4} .0950997{col 72}{space 3}  .395226
{txt}{space 12}Asia  {c |}{col 19}{res}{space 2} .1520997{col 31}{space 2} .0603348{col 42}{space 1}   -4.75{col 51}{space 3}0.000{col 59}{space 4} .0698995{col 72}{space 3} .3309653
{txt}{space 14}NA  {c |}{col 19}{res}{space 2} .0916735{col 31}{space 2} .0931508{col 42}{space 1}   -2.35{col 51}{space 3}0.019{col 59}{space 4} .0125119{col 72}{space 3} .6716806
{txt}{space 9}Oceania  {c |}{col 19}{res}{space 2} .0356574{col 31}{space 2} .0362323{col 42}{space 1}   -3.28{col 51}{space 3}0.001{col 59}{space 4} .0048666{col 72}{space 3} .2612621
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}        0{col 31}{space 2}        0{col 42}{space 1}   -8.57{col 51}{space 3}0.000{col 59}{space 4}        0{col 72}{space 3}        0
{txt}{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
            /ln_p {c |}{col 19}{res}{space 2} 5.278967{col 31}{space 2} .1166492{col 42}{space 1}   45.26{col 51}{space 3}0.000{col 59}{space 4} 5.050339{col 72}{space 3} 5.507596
{txt}{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                p {c |}{col 19}{res}{space 2} 196.1672{col 31}{space 2} 22.88274{col 59}{space 4} 156.0754{col 72}{space 3} 246.5576
{txt}              1/p {c |}{col 19}{res}{space 2} .0050977{col 31}{space 2} .0005946{col 59}{space 4} .0040558{col 72}{space 3} .0064072
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline hazard{txt}.{p_end}

{com}. //_14
. streg ib4.continent_NUMERIC, distribution(exponential) // Exponential distribution

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition

{txt}Iteration 0:{space 3}log likelihood = {res: -148.2325}  
Iteration 1:{space 3}log likelihood = {res:-139.40941}  
Iteration 2:{space 3}log likelihood = {res:-131.58499}  
Iteration 3:{space 3}log likelihood = {res:-131.55897}  
Iteration 4:{space 3}log likelihood = {res:-131.55892}  
Iteration 5:{space 3}log likelihood = {res:-131.55892}  
{res}
{txt}Exponential PH regression

No. of subjects = {res}{ralign 7:248}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:248}
{txt}No. of failures = {res}{ralign 7:62}
{txt}Time at risk    = {res}{ralign 7:500,452}
{col 57}{txt}{lalign 13:LR chi2({res:5})} = {res}{ralign 6:33.35}
{txt}Log likelihood = {res}-131.55892{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               _t{col 19}{c |} Haz. ratio{col 31}   Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
continent_NUMERIC {c |}
{space 10}Africa  {c |}{col 19}{res}{space 2} .2736219{col 31}{space 2}  .099129{col 42}{space 1}   -3.58{col 51}{space 3}0.000{col 59}{space 4}  .134516{col 72}{space 3} .5565804
{txt}{space 8}Americas  {c |}{col 19}{res}{space 2} .3052592{col 31}{space 2} .1105907{col 42}{space 1}   -3.28{col 51}{space 3}0.001{col 59}{space 4} .1500692{col 72}{space 3} .6209345
{txt}{space 12}Asia  {c |}{col 19}{res}{space 2} .2489781{col 31}{space 2} .0984172{col 42}{space 1}   -3.52{col 51}{space 3}0.000{col 59}{space 4} .1147345{col 72}{space 3} .5402914
{txt}{space 14}NA  {c |}{col 19}{res}{space 2} .1586176{col 31}{space 2} .1610769{col 42}{space 1}   -1.81{col 51}{space 3}0.070{col 59}{space 4} .0216746{col 72}{space 3} 1.160782
{txt}{space 9}Oceania  {c |}{col 19}{res}{space 2}  .061017{col 31}{space 2}  .061963{col 42}{space 1}   -2.75{col 51}{space 3}0.006{col 59}{space 4} .0083378{col 72}{space 3} .4465293
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  .000312{col 31}{space 2} .0000552{col 42}{space 1}  -45.67{col 51}{space 3}0.000{col 59}{space 4} .0002206{col 72}{space 3} .0004412
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline hazard{txt}.{p_end}

{com}. //_15
. stcox ib4.continent_NUMERIC // Cox Proportional Hazards Model

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition

{txt}Iteration 0:   log likelihood = {res}-333.92184
{txt}Iteration 1:   log likelihood = {res}-317.94407
{txt}Iteration 2:   log likelihood = {res}-308.96171
{txt}Iteration 3:   log likelihood = {res}-308.00801
{txt}Iteration 4:   log likelihood = {res}-308.00737
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-308.00737

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:248}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:248}
{txt}No. of failures = {res}{ralign 7:62}
{txt}Time at risk    = {res}{ralign 7:500,452}
{col 57}{txt}{lalign 13:LR chi2({res:5})} = {res}{ralign 6:51.83}
{txt}Log likelihood = {res}-308.00737{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               _t{col 19}{c |} Haz. ratio{col 31}   Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
continent_NUMERIC {c |}
{space 10}Africa  {c |}{col 19}{res}{space 2} .1769827{col 31}{space 2} .0643396{col 42}{space 1}   -4.76{col 51}{space 3}0.000{col 59}{space 4} .0867938{col 72}{space 3} .3608887
{txt}{space 8}Americas  {c |}{col 19}{res}{space 2} .2023186{col 31}{space 2} .0735008{col 42}{space 1}   -4.40{col 51}{space 3}0.000{col 59}{space 4} .0992661{col 72}{space 3} .4123544
{txt}{space 12}Asia  {c |}{col 19}{res}{space 2} .1610376{col 31}{space 2} .0638871{col 42}{space 1}   -4.60{col 51}{space 3}0.000{col 59}{space 4} .0740009{col 72}{space 3} .3504428
{txt}{space 14}NA  {c |}{col 19}{res}{space 2} .0969297{col 31}{space 2} .0984941{col 42}{space 1}   -2.30{col 51}{space 3}0.022{col 59}{space 4} .0132287{col 72}{space 3} .7102257
{txt}{space 9}Oceania  {c |}{col 19}{res}{space 2} .0380401{col 31}{space 2}  .038653{col 42}{space 1}   -3.22{col 51}{space 3}0.001{col 59}{space 4} .0051919{col 72}{space 3} .2787139
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_16
. stcurve, survival scheme(michigan) // survival curve
{res}{txt}
{com}. //_17
. graph export survival1A.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
survival1A.png{rm}
saved as
PNG
format
{p_end}

{com}. //_18
. stcurve, failure scheme(michigan) // failure curve
{res}{txt}
{com}. //_19
. graph export survival1B.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
survival1B.png{rm}
saved as
PNG
format
{p_end}

{com}. //_20
. stcurve, failure at(continent_NUMERIC= (1 2 3 4 5 6)) ///
> legend(order(1 "Africa" 2 "Americas" 3 "Asia" ///
> 4 "Europe" 5 "NA" 6 "Oceania")) ///
> scheme(michigan) // survival curve by continent
{res}{txt}
{com}. //_21
. graph export survival2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
survival2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_22
. estat phtest // formal test of PH assumption

{txt}Test of proportional-hazards assumption

Time function: Analysis time
{hline 13}{c TT}{hline 34}
             {c |}     chi2       df       Prob>chi2
{hline 13}{c +}{hline 34}
 Global test {c |}{res}{col 15}     6.20{col 28}    5{col 43}0.2870
{txt}{hline 13}{c BT}{hline 34}

{com}. //_23
. stphplot, by(continent_NUMERIC) scheme(michigan) // graphical test of PH assumption

{col 9}{txt}Failure {bf:_d}: {res}f==1
{col 3}{txt}Analysis time {bf:_t}: {res}year_of_prohibition
{txt}
{com}. //_24
. graph export ph.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
ph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_25
. ltable year_of_prohibition f, graph failure scheme(michigan) // lifetable

{txt}{col 18}Beg.{col 44}Cum.{col 55}Std.
{col 4}Interval{col 17}Total{col 25}Deaths{col 34}Lost{col 42}Failure{col 54}Error{col 64}[95% Conf. Int.]
{hline 79}
 1979  1980{res}       248        1      0     0.0040    0.0040     0.0006    0.0283
{txt} 1983  1984{res}       247        1      0     0.0081    0.0057     0.0020    0.0319
{txt} 1987  1988{res}       246        1      0     0.0121    0.0069     0.0039    0.0370
{txt} 1989  1990{res}       245        1      0     0.0161    0.0080     0.0061    0.0424
{txt} 1994  1995{res}       244        1      0     0.0202    0.0089     0.0084    0.0478
{txt} 1997  1998{res}       243        1      0     0.0242    0.0098     0.0109    0.0531
{txt} 1998  1999{res}       242        1      0     0.0282    0.0105     0.0136    0.0583
{txt} 1999  2000{res}       241        1      0     0.0323    0.0112     0.0163    0.0635
{txt} 2000  2001{res}       240        3      0     0.0444    0.0131     0.0248    0.0787
{txt} 2002  2003{res}       237        1      0     0.0484    0.0136     0.0278    0.0836
{txt} 2003  2004{res}       236        1      0     0.0524    0.0142     0.0308    0.0886
{txt} 2004  2005{res}       235        2      0     0.0605    0.0151     0.0369    0.0983
{txt} 2005  2006{res}       233        1      0     0.0645    0.0156     0.0400    0.1032
{txt} 2006  2007{res}       232        1      0     0.0685    0.0160     0.0432    0.1080
{txt} 2007  2008{res}       231        7      0     0.0968    0.0188     0.0659    0.1409
{txt} 2008  2009{res}       224        4      0     0.1129    0.0201     0.0794    0.1593
{txt} 2010  2011{res}       220        5      0     0.1331    0.0216     0.0965    0.1820
{txt} 2011  2012{res}       215        1      0     0.1371    0.0218     0.1000    0.1865
{txt} 2013  2014{res}       214        2      0     0.1452    0.0224     0.1069    0.1955
{txt} 2014  2015{res}       212        8      0     0.1774    0.0243     0.1352    0.2309
{txt} 2015  2016{res}       204        4      0     0.1935    0.0251     0.1496    0.2484
{txt} 2016  2017{res}       200        4      0     0.2097    0.0258     0.1641    0.2658
{txt} 2017  2018{res}       196        1      0     0.2137    0.0260     0.1677    0.2701
{txt} 2018  2019{res}       195        1      0     0.2177    0.0262     0.1713    0.2745
{txt} 2019  2020{res}       194        5      0     0.2379    0.0270     0.1897    0.2960
{txt} 2020  2021{res}       189        1      0     0.2419    0.0272     0.1934    0.3002
{txt} 2021  2022{res}       188        2    186     0.2579    0.0289     0.2062    0.3196
{txt}{hline 79}

{com}. //_26
. graph export myltable.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
myltable.png{rm}
saved as
PNG
format
{p_end}

{com}. //_27
. generate years_at_risk =  year_of_prohibition - 1978 + 1 // years "at risk" of enacting a ban
{txt}
{com}. //_28
. expand years_at_risk // "expand" the data; 1 row for every year at risk
{txt}(9,908 observations created)

{com}. //_29
. bysort country_code: generate year = _n + 1977 // generate a year variable for each row
{txt}
{com}. //_30
. generate event = type == "CP Ban" & year_of_prohibition == year // generate an event indicator
{txt}
{com}. //_31
. list country_code year_of_prohibition event continent years_at_risk year ///
> if country_code == "NOR" | country_code == "GBR" , ab(20) // list out a sample of the data
{txt}
       {c TLC}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c TRC}
       {c |} {res}country_code   year_of_prohibition   event   continent   years_at_risk   year {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3172. {c |} {res}         GBR                  2021       0      Europe              44   1978 {txt}{c |}
 3173. {c |} {res}         GBR                  2021       0      Europe              44   1979 {txt}{c |}
 3174. {c |} {res}         GBR                  2021       0      Europe              44   1980 {txt}{c |}
 3175. {c |} {res}         GBR                  2021       0      Europe              44   1981 {txt}{c |}
 3176. {c |} {res}         GBR                  2021       0      Europe              44   1982 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3177. {c |} {res}         GBR                  2021       0      Europe              44   1983 {txt}{c |}
 3178. {c |} {res}         GBR                  2021       0      Europe              44   1984 {txt}{c |}
 3179. {c |} {res}         GBR                  2021       0      Europe              44   1985 {txt}{c |}
 3180. {c |} {res}         GBR                  2021       0      Europe              44   1986 {txt}{c |}
 3181. {c |} {res}         GBR                  2021       0      Europe              44   1987 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3182. {c |} {res}         GBR                  2021       0      Europe              44   1988 {txt}{c |}
 3183. {c |} {res}         GBR                  2021       0      Europe              44   1989 {txt}{c |}
 3184. {c |} {res}         GBR                  2021       0      Europe              44   1990 {txt}{c |}
 3185. {c |} {res}         GBR                  2021       0      Europe              44   1991 {txt}{c |}
 3186. {c |} {res}         GBR                  2021       0      Europe              44   1992 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3187. {c |} {res}         GBR                  2021       0      Europe              44   1993 {txt}{c |}
 3188. {c |} {res}         GBR                  2021       0      Europe              44   1994 {txt}{c |}
 3189. {c |} {res}         GBR                  2021       0      Europe              44   1995 {txt}{c |}
 3190. {c |} {res}         GBR                  2021       0      Europe              44   1996 {txt}{c |}
 3191. {c |} {res}         GBR                  2021       0      Europe              44   1997 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3192. {c |} {res}         GBR                  2021       0      Europe              44   1998 {txt}{c |}
 3193. {c |} {res}         GBR                  2021       0      Europe              44   1999 {txt}{c |}
 3194. {c |} {res}         GBR                  2021       0      Europe              44   2000 {txt}{c |}
 3195. {c |} {res}         GBR                  2021       0      Europe              44   2001 {txt}{c |}
 3196. {c |} {res}         GBR                  2021       0      Europe              44   2002 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3197. {c |} {res}         GBR                  2021       0      Europe              44   2003 {txt}{c |}
 3198. {c |} {res}         GBR                  2021       0      Europe              44   2004 {txt}{c |}
 3199. {c |} {res}         GBR                  2021       0      Europe              44   2005 {txt}{c |}
 3200. {c |} {res}         GBR                  2021       0      Europe              44   2006 {txt}{c |}
 3201. {c |} {res}         GBR                  2021       0      Europe              44   2007 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3202. {c |} {res}         GBR                  2021       0      Europe              44   2008 {txt}{c |}
 3203. {c |} {res}         GBR                  2021       0      Europe              44   2009 {txt}{c |}
 3204. {c |} {res}         GBR                  2021       0      Europe              44   2010 {txt}{c |}
 3205. {c |} {res}         GBR                  2021       0      Europe              44   2011 {txt}{c |}
 3206. {c |} {res}         GBR                  2021       0      Europe              44   2012 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3207. {c |} {res}         GBR                  2021       0      Europe              44   2013 {txt}{c |}
 3208. {c |} {res}         GBR                  2021       0      Europe              44   2014 {txt}{c |}
 3209. {c |} {res}         GBR                  2021       0      Europe              44   2015 {txt}{c |}
 3210. {c |} {res}         GBR                  2021       0      Europe              44   2016 {txt}{c |}
 3211. {c |} {res}         GBR                  2021       0      Europe              44   2017 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 3212. {c |} {res}         GBR                  2021       0      Europe              44   2018 {txt}{c |}
 3213. {c |} {res}         GBR                  2021       0      Europe              44   2019 {txt}{c |}
 3214. {c |} {res}         GBR                  2021       0      Europe              44   2020 {txt}{c |}
 3215. {c |} {res}         GBR                  2021       0      Europe              44   2021 {txt}{c |}
 6811. {c |} {res}         NOR                  1987       0      Europe              10   1978 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 6812. {c |} {res}         NOR                  1987       0      Europe              10   1979 {txt}{c |}
 6813. {c |} {res}         NOR                  1987       0      Europe              10   1980 {txt}{c |}
 6814. {c |} {res}         NOR                  1987       0      Europe              10   1981 {txt}{c |}
 6815. {c |} {res}         NOR                  1987       0      Europe              10   1982 {txt}{c |}
 6816. {c |} {res}         NOR                  1987       0      Europe              10   1983 {txt}{c |}
       {c LT}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c RT}
 6817. {c |} {res}         NOR                  1987       0      Europe              10   1984 {txt}{c |}
 6818. {c |} {res}         NOR                  1987       0      Europe              10   1985 {txt}{c |}
 6819. {c |} {res}         NOR                  1987       0      Europe              10   1986 {txt}{c |}
 6820. {c |} {res}         NOR                  1987       1      Europe              10   1987 {txt}{c |}
       {c BLC}{hline 14}{c -}{hline 21}{c -}{hline 7}{c -}{hline 11}{c -}{hline 15}{c -}{hline 6}{c BRC}

{com}. //_32
. logit event ib4.continent_NUMERIC, cluster(country_code) or

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-377.92887}  
Iteration 1:{space 3}log pseudolikelihood = {res:-375.10409}  
Iteration 2:{space 3}log pseudolikelihood = {res:-356.66291}  
Iteration 3:{space 3}log pseudolikelihood = {res:-356.57244}  
Iteration 4:{space 3}log pseudolikelihood = {res:-356.57228}  
Iteration 5:{space 3}log pseudolikelihood = {res:-356.57228}  
{res}
{txt}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:10,156}
{txt}{col 57}{lalign 13:Wald chi2({res:5})}{col 70} = {res}{ralign 6:51.46}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}Log pseudolikelihood = {res:-356.57228}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0565}

{txt}{ralign 83:(Std. err. adjusted for {res:248} clusters in country_code)}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}            event{col 19}{c |} Odds ratio{col 31}   std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
continent_NUMERIC {c |}
{space 10}Africa  {c |}{col 19}{res}{space 2} .2166869{col 31}{space 2} .0718543{col 42}{space 1}   -4.61{col 51}{space 3}0.000{col 59}{space 4} .1131281{col 72}{space 3} .4150446
{txt}{space 8}Americas  {c |}{col 19}{res}{space 2} .2442922{col 31}{space 2} .0809085{col 42}{space 1}   -4.26{col 51}{space 3}0.000{col 59}{space 4} .1276425{col 72}{space 3} .4675456
{txt}{space 12}Asia  {c |}{col 19}{res}{space 2} .1984237{col 31}{space 2} .0731346{col 42}{space 1}   -4.39{col 51}{space 3}0.000{col 59}{space 4} .0963517{col 72}{space 3} .4086277
{txt}{space 14}NA  {c |}{col 19}{res}{space 2} .1224256{col 31}{space 2}  .118522{col 42}{space 1}   -2.17{col 51}{space 3}0.030{col 59}{space 4} .0183574{col 72}{space 3} .8164555
{txt}{space 9}Oceania  {c |}{col 19}{res}{space 2} .0473871{col 31}{space 2} .0476801{col 42}{space 1}   -3.03{col 51}{space 3}0.002{col 59}{space 4} .0065947{col 72}{space 3} .3405066
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2} .0186916{col 31}{space 2} .0027184{col 42}{space 1}  -27.36{col 51}{space 3}0.000{col 59}{space 4} .0140557{col 72}{space 3} .0248566
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\research\cpbans\survival-analysis\survival-analysis.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 May 2021, 17:29:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}